// Текст с описанием игры
export const gameDescription =
	`<h1>Добро пожаловать в игру «Лунатики»!!!))</h1>
	<p>В 2023 году на Луне была обнаружена редкая и ценная руда - лунит, способная давать огромное
	количество энергии. Это привлекло внимание двух крупных корпораций - Lunar Mining Corporation
	(LMC) и Moon Resources International (MRI). Их соперничество переросло в открытую войну за право
	добычи и продажи лунита.</p>
	<p>Вы можете выбрать одну из сторон конфликта и возглавить свой космический флот. Ваша задача -
	найти и уничтожить все лунные модули противника на заданном участке поверхности Луны.</p>
	<p>Игра "Лунатики" основана на правилах классической игры «Морской бой».</p>
	<p>Присоединяйтесь к игре «Лунатики" и станьте главой своего космического флота, чтобы одержать
	победу в этой захватывающей битве на Луне!</p>`;

// Текст с правилами игры
export const gameRules =
	`<h2>Правила игры «Лунатики»</h2>
	<ol>
		<li>Играют два игрока на ограниченном поле, представляющем поверхность Луны.</li>
		<li>Каждый игрок расставляет свои лунные модули на игровом поле.</li>
		<li>Модули могут быть разных типов и форм.</li>
		<li>Игроки стреляют друг в друга по очереди, используя орбитальную пушку.</li>
		<li>Цель игры - уничтожить все лунные модули противника.</li>
		<li>Когда игрок попадает в модуль противника, он получает ещё один ход.</li>
		<li>Если игрок промахивается, то ход переходит противнику.</li>
		<li>Игроки не знают расположения модулей противника до тех пор, пока не попадут в них.</li>
		<li>Выигрывает тот игрок, который первым уничтожит все модули противника.</li>
	</ol>`;
